{
    "title": "Projects",
    "description": "A few programs I've made implementing different technologies. It shows just code for now. I work on current and new projects regularly.",
    "list": [
        {
            "title": "Warehouse",
            "description": "Web API for organizing your warehouse items. It can be used as a backend service for e-commerce.",
            "text": "With user authentication, transactional database and asynchronous cache system. It can serve as a microservice in a Distributed System.",
            "repo": "https://github.com/protobon/warehouse",
            "technologies": ["Python", "FastAPI", "Firebase", "MongoDB", "Redis"]
        },
        {
            "title": "Chat Room",
            "description": "Single page application connecting clients in a chat room through Websockets",
            "text": "The purpose of this app is to demonstrate real time communication based in events. This technology is also used in push notifications, data sync, GPS trackers, and more.",
            "repo": "https://github.com/protobon/chat-room-socket-io",
            "technologies": ["Nodejs", "express js", "Socket IO"]
        },
        {
            "title": "Cat Identifier",
            "description": "Three-layer Neural Network trained to identify cats in pictures, using binary classification to determine whether there is a cat in the picture or not.",
            "text": "Binary classification is used in real life not only in images, but also to filter spam, detect fraud, or even to give medical diagnosis.",
            "repo": "https://github.com/protobon/deep_learning",
            "technologies": ["Python", "Numpy", "TensorFlow"]
        },
        {
            "title": "CLI Todo List",
            "description": "Manage your daily Todos",
            "text": "CLI means 'Command Line Interface', is a program handled by commands in a terminal, so it doesn't have a graphical interface. CLI programs are widely used in the world of software development.",
            "repo": "https://github.com/protobon/deep_learning",
            "technologies": ["Go", "Cobra"]
        },
        {
            "title": "Web Portfolio",
            "description": "The source code of the page you're in.",
            "text": "Static page with different components handled with React hooks, all text and images is dynamically added from JSON files. Responsiveness and design with Tailwind CSS.",
            "repo": "https://github.com/protobon/portfolio",
            "technologies": ["React", "Tailwind"]
        }
    ]
}
